Documents/ГТДПоИмпорту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ГТДПоИмпорту</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСНаИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.НДСГТДИмпорт</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСТолькоНаПошлину</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияАкциза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьСопровождениеПоВесу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДополнительныеЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаТаможенногоСбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСопровождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаТаможенногоСбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланкаСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоОС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Емкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактурнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАкциза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДопРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПошлины</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСопровождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаможеннаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТаможенногоСбора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗачетНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗачетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Допрасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументДопрасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДопрасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходитВТаможеннуюСтоимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГТДПоИмпорту/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСлужебные

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	РазностьДат = БухгалтерскийУчетСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("РазностьДат",	РазностьДат);
	
	Возврат СтруктураДанные;
КонецФункции // ПолучитьДанныеДатаПриИзменении()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ПересчитатьДополнительныеЕдиницыИзмерения()
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоМест * СтрокаТабличнойЧасти.Емкость;	
КонецПроцедуры // ПересчитатьДополнительныеЕдиницыИзмерения()

&НаСервере
Процедура ЗаполнениеТовары(МассивДокументов)
	Для каждого ДокументПоступления Из МассивДокументов Цикл
		Для каждого СтрокаПоступления Из ДокументПоступления.Товары Цикл
			СтрокаТабличнойЧасти = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаПоступления);
			СтрокаТабличнойЧасти.ДокументПоступления 	= ДокументПоступления;
			СтрокаТабличнойЧасти.ФактурнаяСтоимость		= Окр(СтрокаПоступления.Сумма * ДокументПоступления.Курс, 2);
			ПересчетСтрокиТабличнойЧастиНаСервере(СтрокаТабличнойЧасти);
		КонецЦикла;
		Для каждого СтрокаПоступления Из ДокументПоступления.ОС Цикл
			СтрокаТабличнойЧасти = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаПоступления);
			СтрокаТабличнойЧасти.Номенклатура 			= СтрокаПоступления.ОсновноеСредство;
			СтрокаТабличнойЧасти.Количество 			= 1;
			СтрокаТабличнойЧасти.ЭтоОС 					= Истина;
			СтрокаТабличнойЧасти.ДокументПоступления 	= ДокументПоступления;
			СтрокаТабличнойЧасти.ФактурнаяСтоимость		= Окр(СтрокаПоступления.Сумма * ДокументПоступления.Курс, 2);
			СтрокаТабличнойЧасти.Цена					= СтрокаТабличнойЧасти.ФактурнаяСтоимость;
			ПересчетСтрокиТабличнойЧастиНаСервере(СтрокаТабличнойЧасти);
			Объект.ЕстьОС 								= Истина;			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры //

&НаСервере
Процедура ЗаполнениеДопрасходы(МассивДокументов)
	Для каждого ДокументДопрасходов Из МассивДокументов Цикл
		Для каждого СтрокаДопрасходы Из ДокументДопрасходов.Услуги Цикл
			СтрокаТабличнойЧасти = Объект.Допрасходы.Добавить();
			СтрокаТабличнойЧасти.ДокументДопрасходов 	= ДокументДопрасходов;
			СтрокаТабличнойЧасти.Номенклатура 			= СтрокаДопрасходы.Номенклатура;
			СтрокаТабличнойЧасти.СуммаДопрасходов		= Окр(СтрокаДопрасходы.Сумма * ДокументДопрасходов.Курс, 2);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //

&НаСервере
Процедура ПересчетСтрокиТабличнойЧастиНаСервере(СтрокаТабличнойЧасти)

	СтрокаТабличнойЧасти.ТаможеннаяСтоимость	= СтрокаТабличнойЧасти.ФактурнаяСтоимость + СтрокаТабличнойЧасти.СуммаДоставки + СтрокаТабличнойЧасти.СуммаАкциза;	
	СтрокаТабличнойЧасти.СуммаТаможенногоСбора	= Окр(СтрокаТабличнойЧасти.ТаможеннаяСтоимость * Объект.СтавкаТаможенногоСбора / 100, 2);
	СтрокаТабличнойЧасти.СуммаПошлины			= Окр(СтрокаТабличнойЧасти.ТаможеннаяСтоимость * Объект.СтавкаПошлины / 100, 2);
	Если СтрокаТабличнойЧасти.ЭтоОС Тогда
		Если УПП.НДСНаПошлинуОСИмпорт Тогда
			СтрокаТабличнойЧасти.БазаНДС = СтрокаТабличнойЧасти.СуммаДоставки + СтрокаТабличнойЧасти.СуммаПошлины;
		Иначе
			СтрокаТабличнойЧасти.БазаНДС = СтрокаТабличнойЧасти.СуммаДоставки;	
		КонецЕсли;	
	Иначе	
		Если Объект.НДСТолькоНаПошлину Тогда
			СтрокаТабличнойЧасти.БазаНДС = СтрокаТабличнойЧасти.СуммаПошлины;
		Иначе
			СтрокаТабличнойЧасти.БазаНДС = СтрокаТабличнойЧасти.ФактурнаяСтоимость + СтрокаТабличнойЧасти.СуммаДоставки + СтрокаТабличнойЧасти.СуммаПошлины + СтрокаТабличнойЧасти.СуммаАкциза;	
		КонецЕсли;	
	КонецЕсли;
	СтрокаТабличнойЧасти.СуммаНДС				= Окр(СтрокаТабличнойЧасти.БазаНДС * ЗначСтавкаНДС / 100, 2);

КонецПроцедуры // ()

&НаКлиенте
Процедура ПересчетИтоговДопрасходы()
	СуммаДопРасходы = 0;
	СуммаДоставки 	= 0;
	Для каждого СтрокаТабличнойЧасти Из Объект.Допрасходы Цикл
		Если СтрокаТабличнойЧасти.ВходитВТаможеннуюСтоимость Тогда
			СуммаДопРасходы = СуммаДопРасходы + СтрокаТабличнойЧасти.СуммаДопрасходов;
		Иначе			
		    СуммаДоставки 	= СуммаДоставки + СтрокаТабличнойЧасти.СуммаДопрасходов;
		КонецЕсли;
	КонецЦикла;
	Если НЕ Объект.СуммаДопРасходы = СуммаДопРасходы Тогда
		Объект.СуммаДопРасходы = СуммаДопРасходы;	
	КонецЕсли;
	Если НЕ Объект.СуммаДоставки = СуммаДоставки Тогда
		Объект.СуммаДоставки = СуммаДоставки;	
	КонецЕсли;

КонецПроцедуры // ПересчетИтоговДопрасходы()

&НаКлиенте
Процедура ПересчетИтоговСборыНалоги()
	Объект.СуммаТаможенногоСбора 	= Окр(Объект.Товары.Итог("ТаможеннаяСтоимость") * Объект.СтавкаТаможенногоСбора /100, 2);
	Объект.СуммаПошлины 			= Окр(Объект.Товары.Итог("ТаможеннаяСтоимость") * Объект.СтавкаПошлины /100, 2);
	Объект.СуммаНДС	                = Окр(Объект.БазаНДС * ЗначСтавкаНДС / 100, 2);

КонецПроцедуры // ПересчетИтоговСборыНалоги()

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСтавкиНДСИзДоговора(Дата, Договор)
	СтавкаНДС = Договор.СтавкаНДС;
	Возврат БухгалтерскийУчетСервер.ПолучитьСтавкуНДС(Дата, СтавкаНДС)
КонецФункции // ПолучитьЗначениеСтавкиНДСИзДоговора(Дата, Договор)

&НаСервереБезКонтекста
Функция СтавкаНДСИзДоговора(Дата, Договор)
	Возврат Договор.СтавкаНДС;
КонецФункции 

&НаКлиенте
Процедура ПриИзмененииДоговора(ДатаДокумента, ДоговорКонтрагента)
	УстановитьСчетаРасчетовСКонтрагентами();
	ЗначСтавкаНДС 			= ПолучитьЗначениеСтавкиНДСИзДоговора(ДатаДокумента, ДоговорКонтрагента).Ставка;
	Объект.СтавкаНДС 		= СтавкаНДСИзДоговора(ДатаДокумента, Объект.ДоговорКонтрагента);
	ЗначСтавкаНДССтрокой 	= Строка(ЗначСтавкаНДС) + "%";
	ПараметрыОбъекта.Вставить("ЗначСтавкаНДС", ЗначСтавкаНДС);
	ПересчетИтоговСборыНалоги()
КонецПроцедуры // ПриИзмененииДоговора(ДатаДокумента, ДоговорКонтрагента)

&НаКлиенте
Процедура УстановитьСчетаРасчетовСКонтрагентами()
	СтруктураДанные 				= Новый Структура("Организация, Контрагент, ДоговорКонтрагента", Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
	СчетаУчета = ПолучитьСчетаРасчетовСКонтрагентами(СтруктураДанные);
	Объект.СчетРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовПоставщика;		
	
КонецПроцедуры // УстановитьСчетаРасчетовСКонтрагентами()

&НаСервереБезКонтекста
Функция ПолучитьСчетаРасчетовСКонтрагентами(СтруктураДанные)
	Возврат БухгалтерскийУчетСервер.ПолучитьСчетаРасчетовСКонтрагентом(СтруктураДанные.Организация, СтруктураДанные.Контрагент, СтруктураДанные.ДоговорКонтрагента);
КонецФункции

&НаСервере
Процедура РассчитатьИРаспределить()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ПолноеРаспределениеПоДокументу(ПараметрыОбъекта);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

&НаКлиенте
Процедура ПроверкаНаличияОС()
	НаличиеОС = Ложь;

	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если СтрокаТабличнойЧасти.ЭтоОС Тогда
			НаличиеОС = Истина;
			Прервать;		
		КонецЕсли;	
	КонецЦикла;
	Если НЕ Объект.ЕстьОС = НаличиеОС Тогда
		Объект.ЕстьОС = НаличиеОС;
	КонецЕсли;	

КонецПроцедуры // ПроверкаНаличияОС()

&НаСервере
Процедура ПересчетТабличнойЧастиТоварыНаСервере()
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		ПересчетСтрокиТабличнойЧастиНаСервере(СтрокаТабличнойЧасти)
	КонецЦикла;	
КонецПроцедуры // ПересчетТабличнойЧастиТоварыНаСервере()

#КонецОбласти

#Область УправлениеВнешнимВидом

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ТоварыЭтоОС.Доступность 		= Объект.ЕстьОС;
	Элементы.ТоварыЕмкость.Видимость 		= Объект.ИспользоватьДополнительныеЕдиницыИзмерения;
	Элементы.ТоварыКоличествоМест.Видимость = Объект.ИспользоватьДополнительныеЕдиницыИзмерения;
	Элементы.ТоварыВес.Видимость			= Объект.РаспределятьСопровождениеПоВесу;
	
КонецПроцедуры // УстановитьВидимостьДоступностьЭлементов()    

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	УПП = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);	
	ПараметрыОбъекта 	= Новый Структура("Дата, ЗначСтавкаНДС");
	ПараметрыОбъекта.Вставить("Дата", ДатаДокумента);
	ЗначСтавкаНДС 				= ПолучитьЗначениеСтавкиНДСИзДоговора(ДатаДокумента, Объект.ДоговорКонтрагента).Ставка;
	ЗначСтавкаНДССтрокой 		= Строка(ЗначСтавкаНДС) + "%";	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ПараметрыОбъекта.Вставить("ЗначСтавкаНДС", ЗначСтавкаНДС);
	КонецЕсли;	
	
	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
    УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаВажныеКоманды);
    // Конец СтандартныеПодсистемы.Печать

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПодборДокументовПоступления" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		МассивДокументов = Параметр.МассивДокументов;
		ЗаполнениеТовары(МассивДокументов);
	ИначеЕсли ИмяСобытия = "ПодборДокументовДопрасходов" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		МассивДокументов = Параметр.МассивДокументов;
		ЗаполнениеДопрасходы(МассивДокументов);
		ПересчетИтоговДопрасходы();
	КонецЕсли;
	РассчитатьИРаспределить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборДокументовПоступления(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен склад.'");
		БухгалтерскийУчетСервер.СообщитьОбОшибке(
			Объект.Ссылка,   
			ТекстСообщения,
			,
			,
			"Объект.Склад",
			Истина);			
		Возврат;					
	КонецЕсли;
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ДатаОтбора", 	ДатаДокумента);
	ПараметрыОтбора.Вставить("Склад", 		Объект.Склад);
	ОткрытьФорму("Документ.ГТДПоИмпорту.Форма.ФормаПодбораДокументовПоступления", ПараметрыОтбора, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовДопрасходов(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ДатаОтбора", ДатаДокумента);
	ОткрытьФорму("Документ.ГТДПоИмпорту.Форма.ФормаПодбораДокументовДопрасходов", ПараметрыОтбора, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросРассчитать", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Данные будут заново распределены и пересчитаны! Продолжить выполнение операции?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        //ЗаполнитьПоДокументу(Объект.ДокументОснование);
        УстановитьВидимостьДоступностьЭлементов();
    КонецЕсли;
КонецПроцедуры // ЗаполнитьПоОснованию()

&НаКлиенте
Процедура ОтветНаВопросРассчитать(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РассчитатьИРаспределить();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросУстановитьПризнакОС(РезультатВопроса, ДополнительныеПараметры) Экспорт
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СтрокаТабличнойЧасти.Номенклатура = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка");
	Иначе
		СтрокаТабличнойЧасти.ЭтоОС = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросУстановитьПризнакНоменклатура(РезультатВопроса, ДополнительныеПараметры) Экспорт
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		СтрокаТабличнойЧасти.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Иначе
		СтрокаТабличнойЧасти.ЭтоОС = Истина;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовШапки

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	УПП = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
	ПараметрыОбъекта.Вставить("Дата", ДатаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработка события изменения организации.
	Объект.Номер = "";
	БухгалтерскийУчетСервер.ПроверитьСуществованиеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
	УПП = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
КонецПроцедуры

&НаКлиенте
Процедура ДопрасходыПриИзменении(Элемент)
	ПересчетИтоговДопрасходы();
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	СтруктураДоговор = БухгалтерскийУчетСервер.ПолучитьДоговорКонтрагента(Объект.Организация, 
												Объект.Контрагент, 
												ВалютаРегламентированногоУчета, 
												ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
	Если ЗначениеЗаполнено(СтруктураДоговор.ДоговорКонтрагента) Тогда
		Объект.ДоговорКонтрагента 	= СтруктураДоговор.ДоговорКонтрагента;
		ПриИзмененииДоговора(ДатаДокумента, Объект.ДоговорКонтрагента);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ПриИзмененииДоговора(ДатаДокумента, Объект.ДоговорКонтрагента)
КонецПроцедуры

&НаКлиенте
Процедура СтавкаТаможенногоСбораПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОСПриИзменении(Элемент)
	НаличиеОС = Ложь;

	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если СтрокаТабличнойЧасти.ЭтоОС Тогда
			НаличиеОС = Истина;
			Прервать;		
		КонецЕсли;	
	КонецЦикла;
	Если НаличиеОС И НЕ Объект.ЕстьОС Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно отменить признак ""Есть ОС"" пока в табличной части ""Товары и ОС"" есть хотя бы одно Основное средство! Сначала удалите строки, содержащие основные средства.'");
		БухгалтерскийУчетСервер.СообщитьОбОшибке(
			Объект.Ссылка,   
			ТекстСообщения,
			,
			,
			,
			Истина);
		
		Объект.ЕстьОС = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияАкцизаПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура СуммаАкцизаПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура СуммаСопровожденияПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьСопровождениеПоВесуПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура НДСТолькоНаПошлинуПриИзменении(Элемент)
	ПересчетТабличнойЧастиТоварыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПошлиныПриИзменении(Элемент)
	РассчитатьИРаспределить();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ЗначСтавкаНДС 			= БухгалтерскийУчетСервер.ПолучитьСтавкуНДС(Объект.Дата, Объект.СтавкаНДС).Ставка;
	ЗначСтавкаНДССтрокой 	= Строка(ЗначСтавкаНДС) + "%";
	ПараметрыОбъекта.Вставить("ЗначСтавкаНДС", ЗначСтавкаНДС);
	ПересчетИтоговСборыНалоги()

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТабличныхЧастей

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьИРаспределить();
	ПроверкаНаличияОС();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕмкостьПриИзменении(Элемент)
	ПересчитатьДополнительныеЕдиницыИзмерения()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	ПересчитатьДополнительныеЕдиницыИзмерения()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЕстьОС И СтрокаТабличнойЧасти.ЭтоОС Тогда
		ТипПоля = "СправочникСсылка.ОсновныеСредства";
		Элементы.ТоварыНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля); 
		Элементы.ТоварыНоменклатура.ОграничениеТипа.ПривестиЗначение(ТипПоля);		
	Иначе
		ТипПоля = "СправочникСсылка.Номенклатура";
		Элементы.ТоварыНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля); 
		Элементы.ТоварыНоменклатура.ОграничениеТипа.ПривестиЗначение(ТипПоля);				
	КонецЕсли;
	Элементы.ТоварыНоменклатура.ВыбиратьТип = Ложь;
	УстановитьВидимостьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЭтоОСПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		Если ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = ТИП("СправочникСсылка.Номенклатура") И СтрокаТабличнойЧасти.ЭтоОС Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросУстановитьПризнакОС", ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'В строке ""%1"" находится Номенклатура. Если установить признак ""Это ОС"", то поле будет очищено. Продолжить установку признака ""Это ОС""?'"), СтрокаТабличнойЧасти.НомерСтроки);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
			
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = ТИП("СправочникСсылка.ОсновныеСредства") И НЕ СтрокаТабличнойЧасти.ЭтоОС Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросУстановитьПризнакНоменклатура", ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'В строке ""%1"" находится Основное средства. Если снять признак ""Это ОС"", то поле будет очищено. Продолжить снятие признака ""Это ОС""?'"), СтрокаТабличнойЧасти.НомерСтроки);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);

		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если Не ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
